In [5]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'key1': ['a', 'a', 'b', 'b', 'a'],
                   'key2': ['one', 'two', 'one', 'two', 'one'],
                   'data1': np.random.randn(5),
                   'data2': np.random.randn(5)})

In [6]:
df

  key1 key2     data1     data2
0    a  one -0.743510 -0.248771
1    a  two  0.060353 -0.890749
2    b  one -0.766594  1.596800
3    b  two -0.672165 -1.384861
4    a  one -0.123911 -1.134754

In [8]:
grouped = df['data1'].groupby(df['key1'])

In [9]:
grouped

In [10]:
grouped.mean()

key1
a   -0.269023
b   -0.719380
Name: data1, dtype: float64

In [11]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [12]:
means

key1  key2
a     one    -0.433711
      two     0.060353
b     one    -0.766594
      two    -0.672165
Name: data1, dtype: float64

In [13]:
means.unstack()

key2       one       two
key1
a    -0.433711  0.060353
b    -0.766594 -0.672165

In [14]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [15]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [16]:
df['data1'].groupby([states, years]).mean()

California  2005    0.060353
            2006   -0.766594
Ohio        2005   -0.707838
            2006   -0.123911
Name: data1, dtype: float64

In [17]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.269023 -0.758091
b    -0.719380  0.105969

In [18]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.433711 -0.691762
     two   0.060353 -0.890749
b    one  -0.766594  1.596800
     two  -0.672165 -1.384861

In [19]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [20]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.743510 -0.248771
1    a  two  0.060353 -0.890749
4    a  one -0.123911 -1.134754
b
  key1 key2     data1     data2
2    b  one -0.766594  1.596800
3    b  two -0.672165 -1.384861

In [21]:
for (k1,k2), group in df.groupby(['key1', 'key2']):
    print(k1, k2)
    print(group)

a one
  key1 key2     data1     data2
0    a  one -0.743510 -0.248771
4    a  one -0.123911 -1.134754
a two
  key1 key2     data1     data2
1    a  two  0.060353 -0.890749
b one
  key1 key2     data1   data2
2    b  one -0.766594  1.5968
b two
  key1 key2     data1     data2
3    b  two -0.672165 -1.384861

In [22]:
pieces = dict(list(df.groupby('key1')))

In [23]:
pieces['b']

  key1 key2     data1     data2
2    b  one -0.766594  1.596800
3    b  two -0.672165 -1.384861

In [24]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [25]:
grouped = df.groupby(df.dtypes, axis=1)

In [27]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -0.743510 -0.248771
1  0.060353 -0.890749
2 -0.766594  1.596800
3 -0.672165 -1.384861
4 -0.123911 -1.134754
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [28]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one  -0.691762
     two  -0.890749
b    one   1.596800
     two  -1.384861

In [30]:
people = pd.DataFrame(np.random.randn(5, 5),
                     columns=['a', 'b', 'c', 'd', 'e'],
                     index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [31]:
people.iloc[2:3, [1,2]] = np.nan

In [32]:
people

               a         b         c         d         e
Joe     2.262926  0.447075  0.608729  0.980671 -0.806750
Steve  -0.377435  0.789452  0.256172 -0.896726 -0.690593
Wes     1.432665       NaN       NaN -0.444380 -1.029099
Jim    -0.598966  0.167162  0.028938  0.384935  0.656687
Travis  0.320082  0.821401  0.582444 -0.729575 -0.344941

In [33]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
          'd': 'blue', 'e': 'red', 'f': 'orange'}

In [35]:
by_column = people.groupby(mapping,axis=1)

In [36]:
by_column.sum()

            blue       red
Joe     1.589400  1.903251
Steve  -0.640554 -0.278576
Wes    -0.444380  0.403566
Jim     0.413873  0.224883
Travis -0.147131  0.796543

In [37]:
map_series = pd.Series(mapping)

In [38]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [40]:
people.groupby(map_series,axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [41]:
people.groupby(len).sum()

          a         b         c         d         e
3  3.096624  0.614237  0.637667  0.921226 -1.179162
5 -0.377435  0.789452  0.256172 -0.896726 -0.690593
6  0.320082  0.821401  0.582444 -0.729575 -0.344941

In [42]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [43]:
people.groupby([len,key_list]).min()

              a         b         c         d         e
3 one  1.432665  0.447075  0.608729 -0.444380 -1.029099
  two -0.598966  0.167162  0.028938  0.384935  0.656687
5 one -0.377435  0.789452  0.256172 -0.896726 -0.690593
6 two  0.320082  0.821401  0.582444 -0.729575 -0.344941

In [44]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP','JP'],
                                    [1,3,5,1,3]],
                                    names=['city','tenor'])